# Задание 4
# a = {1, 2, 3, 4, 5, 6, 3, 5}
# b = {1, 2, 3, 4, 5, 6}
# print(a & b)

# a = {1, 2, 3, 4, 5, 6, 3, 5}
# b = {1, 2, 3, 4, 5, 6}
# print(a ^ b)
# ------------------------
# Задание 2
# day = '12'
# month = '01'
# year = '2012'
# day1 = 'двенадцатое'
# month1 = 'декабря'
# year1 = '2012 года'
# date = 'Сегодня {}.{}.{}'.format(day, month, year)
# date1 = 'Сегодня {} {} {}'.format(day1, month1, year1)
# a = int(input('Формат xx.yy.zzzz = 1 | Словами - 2  '))
# f a == 1:
#    print(date)
# if a == 2:
#    print(date1)
# ------------------------
# Задание 1

